<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<style type="text/css">
					.predmet {margin:30px;width:17cm;}
					.kluc {
						font-family:Arial;
						font-size:10px;
						font-weight:bold;
						float:left;
						padding-left:5px;
					}
					.hodnota {
						font-family:Verdana;
						font-size:11px;
						color:#0000ff;
						float:left;
						padding-left:5px;
						font-style:italic;
					}
					.hlavicka {
						font-family:Arial;
						font-size:10px;
						font-weight:bold;
						background-color:#dddddd;
						text-align:center;
					}
					p { margin:0px; }
				</style>
</head>
<body>
<center>
<table cellspacing="0" cellpadding="5" border="1" class="predmet">
<tr>
<td class="hlavicka">Predmet št&aacute;tnej sk&uacute;šky</td>
</tr>
<tr>
<td>
<div class="kluc">K&oacute;d:</div>
<div class="hodnota">FMFI.KAI/2-AIN-950/09</div>
<div class="kluc">N&aacute;zov:</div>
<div class="hodnota">Met&oacute;dy aplikovanej informatiky</div>
</td>
</tr>
<tr>
<td>
<div class="kluc">Študijn&yacute; program:</div>
<div style="float:none;" class="hodnota"></div>
</td>
</tr>
<tr>
<td>
<div style="float:none;" class="kluc">Obsahov&aacute; n&aacute;plň št&aacute;tnicov&eacute;ho predmetu:</div>
<div class="hodnota">Obsahov&aacute; n&aacute;plň št&aacute;tnicov&eacute;ho predmetu<p>    *  Reprezent&aacute;cie objektov v poč&iacute;tačovej grafike, algoritmy pre určovanie viditeľn&eacute;ho povrchu, hľadanie prienikov a orez&aacute;vanie, rasteriz&aacute;cia a antialiasing, zobrazovac&iacute; kan&aacute;l, s&uacute;radnicov&eacute; s&uacute;stavy v zobrazovacom kan&aacute;li.</p>
<p>    * Agent, PEAS popis agenta, typy jednoduch&yacute;ch agentov, racion&aacute;lny agent; informovane a neinformovan&eacute; prehľad&aacute;vanie, heuristiky, hľadanie heurist&iacute;k; logick&iacute; agenti, datab&aacute;za znalosti, inferenčn&eacute; algoritmy pre v&yacute;rokov&uacute; datab&aacute;zu znalosti; predik&aacute;tov&aacute; datab&aacute;za znalosti, modus ponens, resolvencia, forward a backward chaining; minimax, alfa beta orez&aacute;vanie, pre dvoch aj viacer&yacute;ch hr&aacute;čov.</p>
<p>    * Probl&eacute;my a algoritmy; z&aacute;kladn&eacute; v&yacute;počtov&eacute; modely a miery zložitosti; zložitostn&eacute; triedy, ich z&aacute;kladn&eacute; charakteristiky a hierarchie; redukcia a &uacute;plnosť v zložitostn&yacute;ch triedach; NP-&uacute;pln&eacute; probl&eacute;my; met&oacute;dy, použ&iacute;van&eacute; na riešenie (v&yacute;počtovo) ťažk&yacute;ch probl&eacute;mov.</p>
<p>    * Z&aacute;kladn&eacute; rozdelenie architekt&uacute;r paraleln&yacute;ch poč&iacute;tačov; progress a safety podmienky; &uacute;loha triedenia pre paraleln&eacute; architekt&uacute;ry; probl&eacute;m večeraj&uacute;cich filozofov; komunik&aacute;cia cez chybn&yacute; kan&aacute;l.</p>
<p>    * Časticov&eacute; syst&eacute;my, rovnice pohybu prv&eacute;ho r&aacute;du, integračn&eacute; met&oacute;dy, stavov&yacute; vektor syst&eacute;mu, vonkajšie sily, obmedzuj&uacute;ce podmienky; anim&aacute;cie pohybu a orient&aacute;cie, quaternion a orient&aacute;cia; detekcie kol&iacute;zie, nutn&aacute; a postačuj&uacute;ca podmienka, sily odozvy (response forces); numerick&eacute; riešenie diferenci&aacute;lnych rovn&iacute;c - Eulerova met&oacute;da, Runge-Kuta met&oacute;da; dynamika tuh&yacute;ch telies, rovnice pohybu.</p>
</div>
</td>
</tr>
</table>
</center>
</body>
</html>
